rapport.tex
% Created 2021-12-08 Wed 00:19
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Baptiste Deldicque, Nicolas Fond-Massany, Ines Lebib, Marc Wang}
\date{\today}
\title{Projet - PAM\\\medskip
\large Algorithmes et concepts pour la science des données}
\hypersetup{
 pdfauthor={Baptiste Deldicque, Nicolas Fond-Massany, Ines Lebib, Marc Wang},
 pdftitle={Projet - PAM},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Compléxité de l'algorithme}
\label{sec:org72678a8}
Pour rappel, PAM (\emph{Partitionning Around Medoids}) consiste à faire l'algorithme suivant :
\begin{enumerate}
\item Choisir aléatoirement \(k\) objets du \emph{dataset} \(D\) comme configuration de départ.
\item Tant que le coût de la configuration actuel descend :
\begin{enumerate}
\item Associé chaque objet non représentatif au cluster le plus proche (avec une distance de \emph{Manhattan} dans notre cas)
\item Pour chaque medoid \(m\) et pour chaque non-medoid \(o\) faire :
\begin{enumerate}
\item Calculer le coût \(E\) de la configuration ou \(o\) est un medoid à la place de \(m\).
\item Si ce coût \(E\) est meilleur que le coût précédent \(S\), on garde cette configuration et \(S\) devient \(E\).
\end{enumerate}
\item Si le meilleur échange (au sens de la diminution du coût) permet de dimnuer le coût, effectuer le meilleur échange (\(m\), \(o\)).
\end{enumerate}
\end{enumerate}

L'algorithme est composé de 2 parties. Une première, souvent appeller la \textbf{phase \emph{build}} car on initialise les valeurs de départs. Et une seconde qu'on appelle souvent la \textbf{phase de \emph{swap}} car on échange les medoids afin de trouver un coût minimum.

\textbf{La phase d'initialisation} \emph{(1)} a une complexité négligeable. En effet, on cherche ici à simplement prendre \(K\) objets au hasard dans le \emph{dataset}. C'est une complexité en \(O(n)\).

\textbf{La phase d'échange} \emph{(2)} :
\begin{itemize}
\item \emph{(b)} L'idée est ici de chercher la meilleur configuration en calculant le coût minimal à chaque échange entre \(m\) et \(o\). On va répeter cette opération \((n-k)^2\) fois avec \(n\) le nombre de clusters et \(k\) le nombre d'objet du \emph{dataset}. On enlève \(k\) à \(n\) car on a déjà \(k\) medoids et qu'on ne peut pas avoir deux medoids identiques.
\item Une fois le minimum trouvé on va chercher une configuration encore meilleur. Pour cela, on répète l'opération précèdente tant que le coût diminue. Cette opération est dans le pire des cas fait \(k\) fois.
\end{itemize}

\textbf{Finalement}, on se retrouve avec une complexité en \(O(k(n-k)^2)\).

\section{Comparaison K-MEANS / PAM}
\label{sec:orge23279c}
\end{document}
